In [1]:
import pandas as pd
import numpy as np

## DATA CLEANING

### Cab Data

In [2]:
CabData=pd.read_csv('/home/miano/Documents/DataGlacier/week2/DataSets/Cab_Data.csv')
CabData.head(10)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776
5,10000016,42376,Pink Cab,ATLANTA GA,6.06,72.43,63.024
6,10000017,42372,Pink Cab,AUSTIN TX,44.00,576.15,475.200
7,10000018,42376,Pink Cab,AUSTIN TX,35.65,466.10,377.890
8,10000019,42381,Pink Cab,BOSTON MA,14.40,191.61,146.880
9,10000020,42375,Pink Cab,BOSTON MA,10.89,156.98,113.256

In [3]:
CabData.shape

(359392, 7)

In [4]:
CabData.dtypes

Transaction ID      int64
Date of Travel      int64
Company            object
City               object
KM Travelled      float64
Price Charged     float64
Cost of Trip      float64
dtype: object

In [5]:
CabData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
Transaction ID    359392 non-null int64
Date of Travel    359392 non-null int64
Company           359392 non-null object
City              359392 non-null object
KM Travelled      359392 non-null float64
Price Charged     359392 non-null float64
Cost of Trip      359392 non-null float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [6]:
CabData.isnull().sum()

Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64

There are no missing values in the dataset. The dataset has 7 columns and 359392 rows. However, the dataset has some changes to be made:

1. Data type:

    a) Transaction ID is not supposed to be an integer, should be float type
    
    b) Date of Travel is supposed to be a date, not integer values

In [7]:
#Convert transactions ID to float type
CabData['Transaction ID']=CabData['Transaction ID'].astype(object)
CabData['Transaction ID'].dtype

dtype('O')

In [8]:
#Check for any duplicated values
CabData['Transaction ID'].duplicated().sum()

#There are no duplicated transactions

0

#### Categorical Data

In [9]:
CabData['Company'].value_counts()

Yellow Cab    274681
Pink Cab       84711
Name: Company, dtype: int64

In [10]:
CabData['City'].value_counts()

NEW YORK NY       99885
CHICAGO IL        56625
LOS ANGELES CA    48033
WASHINGTON DC     43737
BOSTON MA         29692
SAN DIEGO CA      20488
SILICON VALLEY     8519
SEATTLE WA         7997
ATLANTA GA         7557
DALLAS TX          7017
MIAMI FL           6454
AUSTIN TX          4896
ORANGE COUNTY      3982
DENVER CO          3825
NASHVILLE TN       3010
SACRAMENTO CA      2367
PHOENIX AZ         2064
TUCSON AZ          1931
PITTSBURGH PA      1313
Name: City, dtype: int64

In [11]:
CabData['City'].value_counts().count()

19

There are 2 companies: Yellow cab and pink cab. 
The two companies operate in 19 cities

#### Numerical Data

### City Data

In [12]:
#Load dataset
city=pd.read_csv('/home/miano/Documents/DataGlacier/week2/DataSets/City.csv')
city.head(20)

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [13]:
city.dtypes

City          object
Population    object
Users         object
dtype: object

In [14]:
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
City          20 non-null object
Population    20 non-null object
Users         20 non-null object
dtypes: object(3)
memory usage: 560.0+ bytes

There are 20 cities, each given its population and users. There are no null values. However, columns population and users are of object data type instead of integer.

In [15]:
#Convert population and users to the correct data type
city['Population']=city['Population'].str.replace(',','')
city['Population'].astype(int)

city['Users']=city['Users'].str.replace(',','')
city['Users'].astype(int)

0     302149
1     164468
2     144132
3      17675
4      27247
5      12994
6      69995
7       6133
8      22157
9      24701
10     12421
11     14978
12     25063
13      5712
14    213609
15      7044
16      3643
17    127001
18      9270
19     80021
Name: Users, dtype: int64

### Customer Data

In [16]:
customer=pd.read_csv(r'/home/miano/Documents/DataGlacier/week2/DataSets/Customer_ID.csv')
customer.head()

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [17]:
customer.shape

(49171, 4)

In [18]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
Customer ID           49171 non-null int64
Gender                49171 non-null object
Age                   49171 non-null int64
Income (USD/Month)    49171 non-null int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [19]:
customer['Gender'].value_counts()

Male      26562
Female    22609
Name: Gender, dtype: int64

In [20]:
# Convert Customer ID into object data type
customer['Customer ID']=customer['Customer ID'].astype(object)

In [21]:
customer.describe()

                Age  Income (USD/Month)
count  49171.000000        49171.000000
mean      35.363121        15015.631856
std       12.599066         8002.208253
min       18.000000         2000.000000
25%       25.000000         8289.500000
50%       33.000000        14656.000000
75%       42.000000        21035.000000
max       65.000000        35000.000000

### Transactions Data

In [22]:
transactions=pd.read_csv(r'/home/miano/Documents/DataGlacier/week2/DataSets/Transaction_ID.csv')
transactions.head()

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [23]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
Transaction ID    440098 non-null int64
Customer ID       440098 non-null int64
Payment_Mode      440098 non-null object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [24]:
# Convert transactions ID and Customer ID into object type
transactions['Customer ID']=transactions['Customer ID'].astype(object)
transactions['Transaction ID']=transactions['Transaction ID'].astype(object)
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
Transaction ID    440098 non-null object
Customer ID       440098 non-null object
Payment_Mode      440098 non-null object
dtypes: object(3)
memory usage: 10.1+ MB

In [25]:
transactions['Payment_Mode'].value_counts()

Card    263991
Cash    176107
Name: Payment_Mode, dtype: int64

In [26]:
transactions.shape

(440098, 3)

Transactions Dataset is fairly cleaned, no missing values. 440098 entries of different transaction IDs, payment modes and customers ID. Only required conversion of Transaction ID and Customer ID into object data types, not integers.

In [27]:
#Check for any duplicated values
transactions['Transaction ID'].duplicated().sum()

0

In [28]:
transactions['Customer ID'].duplicated().sum()

390927

In [29]:
transactions['Customer ID'].value_counts()

494      54
2939     53
2766     51
1070     51
1803     50
2539     50
944      50
903      50
1067     50
1628     50
858      50
126      50
2577     49
1103     49
2895     49
442      49
1360     49
1673     48
2776     48
1452     48
2912     48
336      48
205      48
1532     47
972      47
960      47
696      47
1769     47
1546     47
42879    47
         ..
10243     1
29907     1
10240     1
29909     1
29867     1
10283     1
29866     1
10285     1
10323     1
29801     1
10321     1
29807     1
29808     1
29809     1
10314     1
29816     1
29819     1
29830     1
10303     1
29842     1
29847     1
10300     1
10297     1
29852     1
29855     1
10291     1
10288     1
10287     1
29865     1
47442     1
Name: Customer ID, Length: 49171, dtype: int64

Transaction IDs are not duplicated, hence accurate. But customer IDs are duplicated as one customer can have several transactions

From the three datasets, we can find relations between datasets

a) Link transactions dataset with cab dataset using the transaction ID column

b) Link transactions dataset with customer dataset using the customer ID column

c) Link the cab dataset with city dataset using the city column

Hence, all datasets can be linked to form one large dataset, making data analysis easier.

In [30]:
#Link b) 
customerTransactions=pd.merge(transactions,customer)
customerTransactions.head()

  Transaction ID Customer ID Payment_Mode Gender  Age  Income (USD/Month)
0       10000011       29290         Card   Male   28               10813
1       10351127       29290         Cash   Male   28               10813
2       10412921       29290         Card   Male   28               10813
3       10000012       27703         Card   Male   27                9237
4       10320494       27703         Card   Male   27                9237

In [31]:
#Link a) and b)
data=pd.merge(customerTransactions,CabData)
data.head()

,Transaction ID,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month),Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,29290,Card,Male,28,10813,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10351127,29290,Cash,Male,28,10813,43302,Yellow Cab,ATLANTA GA,26.19,598.70,317.4228
2,10412921,29290,Card,Male,28,10813,43427,Yellow Cab,ATLANTA GA,42.55,792.05,597.4020
3,10000012,27703,Card,Male,27,9237,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
4,10320494,27703,Card,Male,27,9237,43211,Yellow Cab,ATLANTA GA,36.38,721.10,467.1192

In [32]:
#Link c)
#Merge city data with main dataset



data=pd.merge(data,city,on='City')
data.head()

,Transaction ID,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month),Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Population,Users
0,10000011,29290,Card,Male,28,10813,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.6350,814885,24701
1,10351127,29290,Cash,Male,28,10813,43302,Yellow Cab,ATLANTA GA,26.19,598.70,317.4228,814885,24701
2,10412921,29290,Card,Male,28,10813,43427,Yellow Cab,ATLANTA GA,42.55,792.05,597.4020,814885,24701
3,10000012,27703,Card,Male,27,9237,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.8540,814885,24701
4,10320494,27703,Card,Male,27,9237,43211,Yellow Cab,ATLANTA GA,36.38,721.10,467.1192,814885,24701

Now we have one large dataset named "Data" which has combined all info from other datasets. This dataset will be used going forward. But first, we have to convert the date column into an appropriate data type

In [34]:
data['Date of Travel'].value_counts()
#*****

43105    2022
43084    1123
43077    1100
43449    1086
43063    1085
43456    1084
43448    1076
43091    1042
43428    1037
43106    1032
43079    1032
43455    1029
43056    1026
43086    1000
43042     998
43442     991
43414     990
43421     986
42721     979
43420     969
43406     965
43427     960
43441     960
43049     960
43407     957
43072     950
43413     934
43014     932
43044     927
43037     926
         ...
42384     105
42387     105
42430     105
42746     105
43117     104
42382     104
43115     103
43124     101
42396     100
42765     100
42401      99
42402      99
42759      98
42758      97
42403      97
42415      97
43110      96
42398      96
43123      95
42394      95
42395      94
42397      93
43122      93
43128      92
42760      91
42388      88
42381      86
42380      85
42374      47
42373      25
Name: Date of Travel, Length: 1095, dtype: int64

## EXPLORATORY DATA ANALYSIS

In [33]:
#Plotting libraries
import matplotlib.pyplot as plt
import seaborn as sns